# !/usr/bin/env python
# -*- coding: utf-8 -*-
machineName = "L18-Y930"
menuNameDict = {
	"MENU01"	: "十分低水位1",
	"MENU02"	: "十分低水位2",
	"MENU03"	: "十分低水位3",
	"MENU04"	: "十分低水位4",
	"MENU05"	: "十分低水位5",
	"MENU06"	: "十分低水位6",
	"MENU07"	: "十分低水位7",
	"MENU08"	: "十分低水位8",
	"MENU09"	: "十分低水位9",
	"MENU10"	: "十分低水位10",
	"MENU11"	: "十分低水位11",
	"MENU12"	: "十分低水位12",
}
workHeadDictH = {
	'OB_NULL'         	: "等待",
	'OB_Motor'        	: "搅拌",
	'OB_Heater'       	: "加热",
	'OB_Buz'			: "蜂鸣器",
	'OB_Repeat'			: "重复",
	'OB_H_20S_M_0_1S'	: "每20秒2档搅拌0.1秒",
	'OB_M_H_3P20'		: "每20秒1档搅拌3秒",
	'OB_H_60S_M_5S'		: "每60秒1档搅拌5秒",
	'OB_H_120S_M_5S'	: "每120秒1档搅拌5秒",
	'OB_H_CONST_T'		: "恒温加热",
	'OB_M_H'			: "搅拌+1档加热"
}
workHeadDictL = {
	"End_Time"					: "时间",
	"End_Temp"					: "温度",
	"Time_OR_Temp"				: "时间或温度",
	"Time_AND_Temp"				: "时间和温度",
	"Time_OR_Fy"				: "时间或防溢",
	"Time_ORTemp_OR_TempCtrl"	: "时间或温度或突跳器",
	"Temp_OR_Fy"				: "温度或防溢",
	"Time_OR_Temp_OR_Fy"		: "时间或温度或防溢"
}
heatRankDict = {
	"HEAT_L0_0_5" : "0.5",
	"HEAT_L0_1_0" : "1",
	"HEAT_L0_1_5" : "1.5",
	"HEAT_L0_2_0" : "2",
	"HEAT_L0_2_5" : "2.5",
	"HEAT_L0_3_0" : "3",
	"HEAT_L0_3_5" : "3.5",
	"HEAT_L0_4_0" : "4",
	"HEAT_L0_4_5" : "4.5",
	"HEAT_L0_5_0" : "5",
	"HEAT_L0_5_5" : "5.5",
	"HEAT_L0_6_0" : "6",
	"HEAT_L0_6_5" : "6.5",
	"HEAT_L0_7_0" : "7",
	"HEAT_L0_7_5" : "7.5",
	"HEAT_L0_8_0" : "8",
	"HEAT_L0_8_5" : "8.5",
	"HEAT_L0_9_0" : "9",
	"HEAT_L0_9_5" : "9.5",
	"HEAT_L1_0_0" : "10",
	
	'0'		: '0',
	'L0_5'	: '0.5',
	'L1'	: '1',
	'L1_5'	: '1.5',
	'L2_0'	: '2.0',
	'L2'	: '2',
	'L2_5'	: '2.5',
	'L3'	: '3',
	'L3_5'	: '3.5',
	'L4'	: '4',
	'L4_5'	: '4.5',
	'L5'	: '5',
	'L5_5'	: '5.5',
	'L6'	: '6',
	'L6_5'	: '6.5',
	'L7'	: '7',
	'L7_5'	: '7.5',
	'L8'	: '8',
	'L8_5'	: '8.5',
	'L9'	: '9',
	'L9_5'	: '9.5',
	'L10'	: '10'
}
motoRankDict = {

}
